AccumulationRegisters/ПартииТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровКомпании</Name>
			<Comment>Блок учета партий товаров компании собственных и принятых на комиссию</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток товара на складе в разрезе партий</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщикуАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераЗаАвтомобили</v8:Type>
						<v8:Type>cfg:DocumentRef.АктРазногласий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей товар (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия по которой поступил или был взят на комиссию товар</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<Comment>Цены</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен, для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик, историю цен которого необходимо хранить. Если &lt;пусто&gt;, то цену установили мы.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>Блок учета продаж товаров и оказания услуг</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество проданного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоНормочасов</Name>
					<Comment>Количество нормочасов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СебестоимостьУпр</Name>
					<Comment>Себестоимость упр. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Comment>Себестоимость регл. учета с учетом налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСВходящий</Name>
					<Comment>Сумма входящего НДС в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был зафиксирован факт продажи товара</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Проданный товар или оказанная услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Поставщик у которого товар был куплен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Покупатель который купил товар или которому была оказана услуга</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей товар мы продали (собственный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов с покупателем</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании с которого товар был продан</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Авторабота</Name>
					<Comment>Авторабота</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГТД</Name>
					<Comment>ГТД</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщикуАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераЗаАвтомобили</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступленияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.АктРазногласий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗапЧасти</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Брак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГарантийныйРезерв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Хозяйстенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автомобильный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Экспедитор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Витрина</Name>
					<Comment>Витрина</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратныйГарантийный</Name>
					<Comment>Для запчастей, снятых с автомобилей по гарантийным заказ-нарядам</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

WebServices/NDBParts/Ext/Module.bsl
Функция NDBPartsGet(NDBPartsGetRequest)
	// Вставить содержимое обработчика.
	NDBPartsGetType = ФабрикаXDTO.Тип("http://wa.dms.webservice/NDBPartsGetRequest", "NDBPartsGetResponse");
	NDBPartsGet = ФабрикаXDTO.Создать(NDBPartsGetType);   
	
    ТаблицаОщибок = Новый ТаблицаЗначений;
    ТаблицаОщибок.Колонки.Добавить("Код",	 Новый ОписаниеТипов("Строка"));
    ТаблицаОщибок.Колонки.Добавить("ТекстОшибки",		 Новый ОписаниеТипов("Строка"));  
	
	Попытка
    	КодДилера = NDBPartsGetRequest.NDBPartsGet.DealerID;
    Исключение
    	КодДилера = "";
    КонецПопытки;       
    Попытка
    	ТипЗапроса = NDBPartsGetRequest.NDBPartsGet.RequestType;
    Исключение
    	НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "WA03";
		НоваяСтрока.ТекстОшибки = "Не задан тип запроса RequestType";
		NDBPartsGet = обПолучитьВозвратWAError("http://wa.dms.webservice/NDBPartsGetRequest",NDBPartsGetRequest,NDBPartsGet,"-1",ТаблицаОщибок);
		Возврат NDBPartsGet;    
    КонецПопытки;  

	Попытка
    	ДатаЗапросаС = NDBPartsGetRequest.NDBPartsGet.RequestDateTimeFromLocal;
    Исключение
    	ДатаЗапросаС = Дата('00010101');
	КонецПопытки;    
	
	Попытка
    	ДатаЗапросаПо = NDBPartsGetRequest.NDBPartsGet.RequestDateTimeToLocal;
    Исключение
    	ДатаЗапросаПо = Дата('00010101');
    КонецПопытки;       

	ArrayNDBPartsType = ФабрикаXDTO.Тип("http://wa.dms.webservice/NDBPartsGetRequest", "ArrayOfNDBPart");
   	ArrayNDBParts = ФабрикаXDTO.Создать(ArrayNDBPartsType); 
	
    Если ТипЗапроса="1" Тогда
		СписокТиповСклада = Новый Массив();
		СписокТиповСклада.Добавить(Перечисления.ТипыСкладов.ЗапЧасти);
		СписокТиповСклада.Добавить(Перечисления.ТипыСкладов.Витрина);
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПартииТоваровКомпанииОстатки.Номенклатура,
		               |	ЦеныСрезПоследних.Цена,
		               |	ПартииТоваровКомпанииОстатки.КоличествоОстаток,
		               |	ПартииТоваровКомпанииОстатки.СуммаОстаток,
		               |	ВЫБОР
		               |		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
		               |			ТОГДА ""2""
		               |		ИНАЧЕ ""3""
		               |	КОНЕЦ КАК ТипВхДокумента,
		               |	ВЫБОР
		               |		КОГДА ПартииТоваровКомпанииОстатки.Партия ССЫЛКА Документ.ПоступлениеТоваров
		               |			ТОГДА ПартииТоваровКомпанииОстатки.Партия.ВхДокНомер
		               |		ИНАЧЕ """"
		               |	КОНЕЦ КАК НомерВхДокумента
		               |ИЗ
		               |	РегистрНакопления.ПартииТоваровКомпании.Остатки(
		               |			&ДатаВыборки,
		               |			Номенклатура.Производитель В ИЕРАРХИИ (&Производитель)
		               |				И СкладКомпании.ТипСклада В (&СписокТиповСклада)
		               |				И СкладКомпании.Подразделение.ДилерИД = &КодДилера) КАК ПартииТоваровКомпанииОстатки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(
		               |				&ДатаВыборки,
		               |				ТипЦен = &ТипЦен
		               |					И ПодразделениеКомпании.ДилерИД = &КодДилера) КАК ЦеныСрезПоследних
		               |		ПО ПартииТоваровКомпанииОстатки.Номенклатура = ЦеныСрезПоследних.Номенклатура
		               |ГДЕ
		               |	ПартииТоваровКомпанииОстатки.КоличествоОстаток > 0";
					   
		Запрос.УстановитьПараметр("Производитель", Справочники.Производители.Hyundai);
		Запрос.УстановитьПараметр("ТипЦен", Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
		Запрос.УстановитьПараметр("КодДилера", КодДилера);
		Запрос.УстановитьПараметр("СписокТиповСклада", СписокТиповСклада);
		Запрос.УстановитьПараметр("ДатаВыборки", КонецДня(ДатаЗапросаПо));

	    Выборка = Запрос.Выполнить().Выбрать();
		
	    Если Выборка.Количество() = 0 Тогда                         		
			NDBPartsGet = обПолучитьВозвратWAError("http://wa.dms.webservice/NDBPartsGetRequest", NDBPartsGetRequest, NDBPartsGet, "0", ТаблицаОщибок);
			Возврат NDBPartsGet;  		
		Иначе
			Пока Выборка.Следующий() Цикл
				Если ЗначениеЗаполнено(Выборка.Цена) Тогда
					Цена = Выборка.Цена;			
				Иначе
					Цена = 0;			
				КонецЕсли;  			
			    NDBPartType = ФабрикаXDTO.Тип("http://wa.dms.webservice/NDBPartsGetRequest", "NDBPart");
	   			NDBPart = ФабрикаXDTO.Создать(NDBPartType);
				NDBPart.Date = ДатаЗапросаПо;
				NDBPart.DealerID = КодДилера;
				Если КодДилера = "RC536" Тогда
					NDBPart.DealerName = "Avtokom Shakhty";
				ИначеЕсли КодДилера = "RC294" Тогда
					NDBPart.DealerName = "Avtokom-Don";
				Иначе
					NDBPart.DealerName = "";
				КонецЕсли;					
				NDBPart.PartNumber = Выборка.Номенклатура.Артикул;
				NDBPart.PartDescription = Выборка.Номенклатура.Наименование;
				NDBPart.QuantityOnHand = Формат(Выборка.КоличествоОстаток, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
				NDBPart.PurchasePrice = Формат(Выборка.СуммаОстаток / Выборка.КоличествоОстаток, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
				NDBPart.UnitPrice = Формат(Цена, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
				NDBPart.PartType = "1";
	            NDBPart.DocumentType = Выборка.ТипВхДокумента;
				NDBPart.DocumentNo = Выборка.НомерВхДокумента;
	            ArrayNDBParts.NDBPart.Добавить(NDBPart);      			
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТипЗапроса="2" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Продажи.Номенклатура,
		               |	Продажи.Количество,
		               |	Продажи.Сумма,
		               |	Продажи.Себестоимость,
		               |	Продажи.Период КАК Дата,
		               |	Продажи.Регистратор.Номер КАК Номер,
		               |	ВЫБОР
		               |		КОГДА Продажи.Партия ССЫЛКА Документ.ПоступлениеТоваров
		               |			ТОГДА Продажи.Партия.ВхДокНомер
		               |		ИНАЧЕ Продажи.Партия.Номер
		               |	КОНЕЦ КАК НомерВхДокумента
		               |ИЗ
		               |	РегистрНакопления.Продажи КАК Продажи
		               |ГДЕ
		               |	Продажи.Номенклатура.Производитель В ИЕРАРХИИ(&Производитель)
		               |	И Продажи.ХозОперация = &ХозОпреация
		               |	И Продажи.ПодразделениеКомпании.ДилерИД = &КодДилера
		               |	И НЕ Продажи.Покупатель.НашаФирма
		               |	И Продажи.Период МЕЖДУ &ДатаНачала И &ДатаОкончания";
					   
		Запрос.УстановитьПараметр("Производитель", Справочники.Производители.Hyundai);
		Запрос.УстановитьПараметр("ХозОпреация", Справочники.ХозОперации.РеализацияТоваров);
		Запрос.УстановитьПараметр("КодДилера", КодДилера);
		Запрос.Параметры.Вставить("ДатаНачала", НачалоДня(ДатаЗапросаС));
		Запрос.Параметры.Вставить("ДатаОкончания", КонецДня(ДатаЗапросаПо));
		
	    Выборка = Запрос.Выполнить().Выбрать();
		
	    Если Выборка.Количество() = 0 Тогда                         		
			NDBPartsGet = обПолучитьВозвратWAError("http://wa.dms.webservice/NDBPartsGetRequest", NDBPartsGetRequest, NDBPartsGet, "0", ТаблицаОщибок);
			Возврат NDBPartsGet;  		
		Иначе
			Пока Выборка.Следующий() Цикл	
			    NDBPartType = ФабрикаXDTO.Тип("http://wa.dms.webservice/NDBPartsGetRequest", "NDBPart");
	   			NDBPart = ФабрикаXDTO.Создать(NDBPartType);
				NDBPart.Date = Выборка.Дата;
				NDBPart.DealerID = КодДилера;
				Если КодДилера = "RC536" Тогда
					NDBPart.DealerName = "Avtokom Shakhty";
				ИначеЕсли КодДилера = "RC294" Тогда
					NDBPart.DealerName = "Avtokom-Don";
				Иначе
					NDBPart.DealerName = "";
				КонецЕсли;					
				NDBPart.PartNumber = Выборка.Номенклатура.Артикул;
				NDBPart.PartDescription = Выборка.Номенклатура.Наименование;
				NDBPart.QuantityOnHand = Формат(Выборка.Количество, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
				NDBPart.PurchasePrice = Формат(Выборка.Себестоимость / Выборка.Количество, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
				NDBPart.UnitPrice = Формат(Выборка.Сумма / Выборка.Количество, "ЧЦ=15; ЧДЦ=2; ЧРД=.; ЧГ=0");
				NDBPart.PartType = "1";
	            NDBPart.DocumentType = "1";
				NDBPart.DocumentNo = Выборка.НомерВхДокумента;
	            ArrayNDBParts.NDBPart.Добавить(NDBPart);      			
			КонецЦикла;
		КонецЕсли;
		
	Иначе		
    	НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "WA03";
		НоваяСтрока.ТекстОшибки = "Неверный тип запроса RequestType";
		NDBPartsGet = обПолучитьВозвратWAError("http://wa.dms.webservice/NDBPartsGetRequest",NDBPartsGetRequest,NDBPartsGet,"-1",ТаблицаОщибок);
		Возврат NDBPartsGet;    
	КонецЕсли;

	NDBPartsGet.NDBParts = ArrayNDBParts;
	NDBPartsGet = обПолучитьВозвратWAError("http://wa.dms.webservice/NDBPartsGetRequest", NDBPartsGetRequest, NDBPartsGet, "1", ТаблицаОщибок);
	Возврат NDBPartsGet;      
КонецФункции
